Revit 2024 API
HVACLoadType.SensibleHeatGainPerPerson Property
 The sensible heat gain per person.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double SensibleHeatGainPerPerson { get; set; }
Visual Basic
Public Property SensibleHeatGainPerPerson As Double
	Get
	Set
Visual C++
public:
property double SensibleHeatGainPerPerson {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The value should be between [0.0,5381.9].
See Also
HVACLoadType Class
Autodesk.Revit.DB.Analysis Namespace